Tekla.Structures.Drawing.PickerInputInterrupt
The PickerInputInterrupt class represents the interruption of picking by the user (e.g. by
pressing Escape while requested to pick points).
Used for values asked by any UI.Picker.Pick* method where an interrupt happens by the user.

Tekla.Structures.Drawing.PickerInputInterrupt.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.PickerInputInterrupt.#ctor
Creates a new PickerInputInterrupt instance representing the interruption of picking by the user.